Documents/бит_ВводНачальныхОстатковПениПоКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ВводНачальныхОстатковПениПоКУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_НачислениеПениПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНаЛС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДолга</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_ВводНачальныхОстатковПениПоКУ/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

#КонецОбласти

#Область УправлениеВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , Строка(""));
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.бит_ВводНачальныхОстатковПениПоКУ"));	
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(ДокументОбъект, Отказ);
	
	// Заполняем кэш значений.
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьДанныеКолонкиАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	//ОбновитьДанныеКолонкиАдрес();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация"       , Объект.Организация);
	ПараметрыФормы.Вставить("Дата"              , КонецДня(Объект.Дата));
	ПараметрыФормы.Вставить("ОткрытоИзДокумента", Истина);
	
	ОткрытьФорму("Обработка.бит_ПодборЛицевыхСчетов.Форма", ПараметрыФормы, Элементы.СписокЛС);
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Обработчик события "ПриИзменении" поля "ЛицевойСчет" в табличном поле "СписокЛС".
&НаКлиенте
Процедура СписокЛСЛицевойСчетПриИзменении(Элемент)
	
	ТекДанные       = Элементы.СписокЛС.ТекущиеДанные;
	
	УлицаЛицевогоСчета =  ПолучитьУлицуНаСервере(ТекДанные.ЛицевойСчет);
	Здание =  ПолучитьЗданиеНаСервере(ТекДанные.ЛицевойСчет);
	Корпус =  ПолучитьКорпусНаСервере(ТекДанные.ЛицевойСчет);
	Квартира =  ПолучитьКвартируНаСервере(ТекДанные.ЛицевойСчет);
	
	ТекДанные.Адрес = Строка(УлицаЛицевогоСчета)+", д. "+Строка(Здание)+?(ПустаяСтрока(Корпус),"",", кор. "+Корпус)+", кв. "+Строка(Квартира);
	
	Если ЗначениеЗаполнено(ТекДанные.ЛицевойСчет)
		И ЗначениеЗаполнено(ТекДанные.Услуга) Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекДанные.СчетКУ) Тогда
			ТекДанные.СчетКУ = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
		КонецЕсли;
		
		ЗаполнитьСчетаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУлицуНаСервере(ЛицевойСчет)
	
	Возврат ЛицевойСчет.УлицаЛицевогоСчета;
	
КонецФункции

&НаСервере
Функция ПолучитьЗданиеНаСервере(ЛицевойСчет)
	
	Возврат ЛицевойСчет.Здание;
	
КонецФункции

&НаСервере
Функция ПолучитьКорпусНаСервере(ЛицевойСчет)
	
	Возврат ЛицевойСчет.Здание.Корпус;
	
КонецФункции

&НаСервере
Функция ПолучитьКвартируНаСервере(ЛицевойСчет)
	
	Возврат ЛицевойСчет.Квартира;
	
КонецФункции

&НаКлиенте
Процедура СписокЛСОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТаблицаЛСНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаЛСНаСервере(ВыбранноеЗначение)

	ТаблицаЛС = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресЛСВХранилище);
	
	Если ТаблицаЛС = Неопределено Тогда
		
		// Сообщить("Ошибка получения данных из временного хранилища. Выполните подбор заново.", СтатусСообщения.ОченьВажное);.
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка получения данных из временного хранилища. Выполните подбор заново.";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли; 
	
	Для каждого СтрокаТаблицы Из ТаблицаЛС Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ЛицевойСчет", СтрокаТаблицы.ЛицевойСчет);
		
		СтрокиПоиска = Объект.СписокЛС.НайтиСтроки(Отбор);
		
		Если СтрокиПоиска.Количество() = 0 Тогда
			
			НоваяСтрока                 = Объект.СписокЛС.Добавить();
			НоваяСтрока.ЛицевойСчет     = СтрокаТаблицы.ЛицевойСчет;
			НоваяСтрока.ШаблонИзвещений = ПолучитьШаблонИзвещений();
			НоваяСтрока.Адрес           = Строка(СтрокаТаблицы.ЛицевойСчет.УлицаЛицевогоСчета)+", д. "+Строка(СтрокаТаблицы.ЛицевойСчет.Здание)+?(ПустаяСтрока(СтрокаТаблицы.ЛицевойСчет.Здание.Корпус),"",", кор. "+СтрокаТаблицы.ЛицевойСчет.Здание.Корпус)+", кв. "+Строка(СтрокаТаблицы.ЛицевойСчет.Квартира);
			НоваяСтрока.Услуга			= СтрокаТаблицы.Услуга;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСЛицевойСчетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Организация"      , Объект.Организация);
	Отбор.Вставить("НеВестиРасчетПени", Ложь);
	
	ОткрытьФорму("Справочник.бит_ЛицевыеСчета.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСУслугаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекСтрока = Элементы.СписокЛС.ТекущиеДанные;
	
	ЛицевойСчет = ТекСтрока.ЛицевойСчет;
	
	СписокЗнУслуг = ПолучитьСписокЗначенийУслуг(ЛицевойСчет);
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка",СписокЗнУслуг);
	
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор",Отбор),Элемент);
	
КонецПроцедуры

// Служебная функция получения значения реквизита объекта (выполняется на сервере).
&НаСервере
Функция ПолучитьШаблонИзвещений()
	
	Возврат Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
	
КонецФункции

// Служебная процедура для заполнения колонки "Адрес" табличного поля "СписокЛС".
&НаСервере
Процедура ОбновитьДанныеКолонкиАдрес()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Здание.Корпус КАК Корпус,
	|	бит_ЛицевыеСчета.Квартира
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Ссылка В(&СписокЛицевыхСчетов)"
	);
	
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов",Объект.СписокЛС.Выгрузить().ВыгрузитьКолонку("ЛицевойСчет"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого Стр Из Объект.СписокЛС Цикл
		
		Если Выборка.НайтиСледующий(Стр.ЛицевойСчет,"ЛицевойСчет") Тогда
			
			Стр.Адрес = Строка(Выборка.УлицаЛицевогоСчета) + ", д. " + Строка(Выборка.Здание) + ?(ПустаяСтрока(Выборка.Корпус),"",", кор. " + Строка(Выборка.Корпус)) + ", кв. " + Строка(Выборка.Квартира);
			Выборка.Сбросить();
		Иначе
			
			Стр.Адрес = "";
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Функция ПолучитьСписокЗначенийУслуг(ЛицевойСчет)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)";
	
	Запрос.УстановитьПараметр("ЛицевойСчет",ЛицевойСчет);   
	Запрос.УстановитьПараметр("Момент"     ,Объект.Дата);
	
	СписокЗнУслуг = Новый СписокЗначений;
	СписокЗнУслуг.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Услуга"));
	
	Возврат СписокЗнУслуг;
	
КонецФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	// Запишем параметр для формирования заголовка.
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("Организация"         , Объект.Организация);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.СписокЛС.Количество() > 0 Тогда
		
		Ответ = Неопределено;
		
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОрганизацияПриИзмененииЗавершение", ЭтотОбъект), "Табличная часть будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Объект.СписокЛС.Очистить();
	Объект.СписокУслуг.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.Проведен Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Перед изменением таблицы лицевых счетов - распроведите документ";
		Сообщение.Сообщить();
		СтандартнаяОбработка = Ложь;
		
	Иначе
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССчетАбонентаПриИзменении(Элемент)

	СтрокаПлатеж  = Элементы.СписокЛС.ТекущиеДанные;
	УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(ЭтаФорма, СтрокаПлатеж.СчетАбонента, "", Истина, Истина);
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
								  "Субконто1", "Субконто2", "Субконто3");
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетАбонента, СтрокаПлатеж, ПоляОбъекта, Истина, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССчетАбонентаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССчетКУПриИзменении(Элемент)
	
	СтрокаПлатеж = Элементы.СписокЛС.ТекущиеДанные;
	УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(ЭтаФорма, СтрокаПлатеж.СчетКУ, "КУ", Ложь, Истина);
	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3", 
								  "СубконтоКУ1", "СубконтоКУ2", "СубконтоКУ3");
	бит_БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(СтрокаПлатеж.СчетКУ, СтрокаПлатеж, ПоляОбъекта, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССчетКУОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = бит_БухгалтерскийУчетСервер.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССубконтоПриИзменении(Элемент)
	
	ИзменитьПараметрыВыбораПолейСубконтоЛицевыеСчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССубконтоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "Субконто%Индекс%");
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетАбонента);
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛССубконтоКУНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтрокаТаблицы = Элементы.СписокЛС.ТекущиеДанные;
	ПараметрыДокумента = ПолучитьСписокПараметров(ЭтаФорма, СтрокаТаблицы, "СубконтоКУ%Индекс%");
	ПараметрыДокумента.Вставить("СчетУчета", СтрокаТаблицы.СчетКУ);
	бит_БухгалтерскийУчетКлиент.НачалоВыбораЗначенияСубконто(ЭтаФорма, Элемент, СтандартнаяОбработка, ПараметрыДокумента);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконтоЛицевыеСчета(Форма, Счет, Постфикс = "", ЕстьПодразделение, ЭтоТаблица = Ложь)

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
								"СписокЛССубконто" + Постфикс + "1", 
								"СписокЛССубконто" + Постфикс + "2", 
								"СписокЛССубконто" + Постфикс + "3");
	
	бит_БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, Неопределено, ЭтоТаблица);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконтоЛицевыеСчета(Форма)
	
	СтрокаПлатеж       = Форма.Объект.СписокЛС.НайтиПоИдентификатору(Форма.Элементы.СписокЛС.ТекущаяСтрока);
	
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "Субконто%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "Субконто%Индекс%", "СписокЛССубконто%Индекс%", ПараметрыДокумента);
	
	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%");
	
	бит_БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(Форма, СтрокаПлатеж, "СубконтоКУ%Индекс%", "СписокЛССубконтоКУ%Индекс%", ПараметрыДокумента); 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Форма, Объект, ШаблонИмяПоляОбъекта)
	
	СписокПараметров = Новый Структура;
	
	Для Индекс = 1 По 3 Цикл
		
		ИмяПоля = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		
		Если ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Контрагенты") Тогда
			
			СписокПараметров.Вставить("Контрагент", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			СписокПараметров.Вставить("ДоговорКонтрагента", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			СписокПараметров.Вставить("Номенклатура", Объект[ИмяПоля]);
			
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Склады") Тогда
			
			СписокПараметров.Вставить("Склад", Объект[ИмяПоля]);
			
		КонецЕсли;
		
	КонецЦикла;
	
	СписокПараметров.Вставить("ОстаткиОбороты", 1);
	СписокПараметров.Вставить("Организация"   , Форма.Объект.Организация);
	
	Возврат СписокПараметров;
	
КонецФункции

// Процедура выполняет заполнение Счетов и Субконто.
&НаСервере
Процедура ЗаполнитьСчетаНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект,  Тип("ДокументОбъект.бит_ВводНачальныхОстатковПениПоКУ"));
	ДокументОбъект.ЗапролнитьСчета();
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
    ОбновитьДанныеКолонкиАдрес();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЛСУслугаПриИзменении(Элемент)
	
    ТекДанные = Элементы.СписокЛС.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДанные.ЛицевойСчет)
		И ЗначениеЗаполнено(ТекДанные.Услуга) Тогда
		ЗаполнитьСчетаНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьДанныеКолонкиАдрес();
	
КонецПроцедуры

#КонецОбласти
